Revit 2027 API
MEPHiddenLineSettings.InsideGap Property
 The gap for the lines that appear within a crossing segment.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double InsideGap { get; set; }
Public Property InsideGap As Double
	Get
	Set
public:
property double InsideGap {
	double get ();
	void set (double value);
}
member InsideGap : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The gap size must be between 0" and 3/4".
See Also
Reference
MEPHiddenLineSettings Class
Autodesk.Revit.DB.Mechanical Namespace